--<<data_1100_GuaJiVar 导表开始>>
data_1100_GuaJiVar = {

	AddRatioPerSec = 10, 			-- 每秒增加10%的遇怪概率

	CostDP = 2, 			-- 每场战斗消耗的双倍点数

	ExpMulti = 10, 			-- 消耗双倍点数后获得的经验倍数

	RatioLimit = {[0]=75,[100]=20,[200]=5}, 			-- [0-100):75%,[100,200):20%,[200,xxx):5%

	ItemTypeRatio = {[401001]=500,[401002]=1000,[401003]=1000,[401004]=1000,[401005]=1000,[401006]=1000,[401007]=1000,[401008]=1000,[401009]=1000,[401010]=1000,[401011]=2000,[401012]=2000,[401013]=2000,[401014]=2000,[401015]=2000,[401016]=2000,}, 			-- {[物品类型]=互斥概率,...}

}
return data_1100_GuaJiVar
--<<data_1100_GuaJiVar 导表结束>>